backend/src/test/jmeter/report_login/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 211.2339999999998,
    "medianResTime" : 193.5,
    "minResTime" : 146.0,
    "maxResTime" : 1362.0,
    "pct1ResTime" : 273.9,
    "pct2ResTime" : 317.7999999999997,
    "pct3ResTime" : 462.8700000000001,
    "throughput" : 16.43115346697338,
    "receivedKBytesPerSec" : 6.464840540790338,
    "sentKBytesPerSec" : 3.4000453140404208
  },
  "PUT /users/login" : {
    "transaction" : "PUT /users/login",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 211.2339999999998,
    "medianResTime" : 193.5,
    "minResTime" : 146.0,
    "maxResTime" : 1362.0,
    "pct1ResTime" : 273.9,
    "pct2ResTime" : 317.7999999999997,
    "pct3ResTime" : 462.8700000000001,
    "throughput" : 16.43115346697338,
    "receivedKBytesPerSec" : 6.464840540790338,
    "sentKBytesPerSec" : 3.4000453140404208
  }
}